{
  "architectures": [
    "Revised_PatchTSMixerForTimeSeriesClassification"
  ],
  "channel_consistent_masking": true,
  "context_length": 1024,
  "d_model": 80,
  "distribution_output": "student_t",
  "dropout": 0.2,
  "expansion_factor": 2,
  "gated_attn": true,
  "head_aggregation": "max_pool",
  "head_dropout": 0.2,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2",
    "3": "LABEL_3",
    "4": "LABEL_4",
    "5": "LABEL_5",
    "6": "LABEL_6",
    "7": "LABEL_7",
    "8": "LABEL_8"
  },
  "init_std": 0.02,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2,
    "LABEL_3": 3,
    "LABEL_4": 4,
    "LABEL_5": 5,
    "LABEL_6": 6,
    "LABEL_7": 7,
    "LABEL_8": 8
  },
  "loss": "mse",
  "mask_type": "random",
  "mask_value": 0,
  "masked_loss": true,
  "mode": "common_channel",
  "model_type": "patchtsmixer",
  "norm_eps": 1e-05,
  "norm_mlp": "LayerNorm",
  "num_forecast_mask_patches": [
    2
  ],
  "num_input_channels": 6,
  "num_layers": 4,
  "num_parallel_samples": 100,
  "num_patches": 64,
  "num_targets": 9,
  "output_range": null,
  "patch_last": true,
  "patch_length": 16,
  "patch_stride": 16,
  "positional_encoding_type": "sincos",
  "post_init": false,
  "prediction_channel_indices": null,
  "prediction_length": 16,
  "random_mask_ratio": 0.5,
  "scaling": "std",
  "self_attn": false,
  "self_attn_heads": 1,
  "torch_dtype": "float32",
  "transformers_version": "4.48.3",
  "unmasked_channel_indices": null,
  "use_positional_encoding": false
}
